Tekla Open API Reference for Tekla Structures 2025
Events.AnnotationSelectionChange Event
 The SelectionChange event is raised when the user changes the current selection of an annotation inside Tekla Structures.
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public event Events.SelectionChangeDelegate AnnotationSelectionChange
Public Event AnnotationSelectionChange As Events.SelectionChangeDelegate
Value
Type: Tekla.Structures.Model.Events.SelectionChangeDelegate
See Also
Reference
Events Class
Tekla.Structures.Model Namespace